Tofu plan:

```txt
module.region["hel01"].local_file.config: Refreshing state... [id=62b91e8a7c693b1175f57661ef5613ab0cfa2c64]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.region["hel01"].local_file.config will be created
  + resource "local_file" "config" {
      + content              = <<-EOT
            "metadata":
              "name": "hel01"
            "spec":
              "provider": "Baremetal"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/runner/work/homelab/homelab/deploy/tofu/out/hel01.out"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```